{
  "standard": {
    "Toa Payoh": {
      "order": 0,
      "challenges": [
        {
          "description": "Visit the hexagonal bridge feature across the pond in toa payoh park. Count the number of hexagonal platforms.",
          "steps": [
            {
              "description": "How many hexagon platforms are there?",
              "type": "Text",
              "answer": "8"
            },
            {
              "description": "Perform a 40s dance as a group to this video: https://youtube.com/clip/UgkxP3mNA2akCbmwchxBmynaCz9Xcg9izbZw?si=yYO4lPnS5SCyTM_s. Send the video here!",
              "type": "Video"
            }
          ]
        }
      ]
    },
    "Bishan": {
      "order": 1,
      "challenges": [
        {
          "description": "Solve the wordle: https://mywordle.strivemath.com/?word=wbtkzvar. Then go to Fairprice Finest, find and take a pictures of foods that start with every letter of word in Wordle.",
          "steps": [
            {
              "description": "What's the answer to the Wordle? (Answer in ALL CAPS)",
              "type": "Text",
              "answer": "ANCHORED"
            },
            {
              "description": "Send me 8 pictures, 1 for each letter in ANCHORED!",
              "type": "Photo",
              "num_photo": 8
            }
          ]
        },
        {
          "description": "Based on the following reviews of the place, guess the location:\n\"very accessible and clean. The only Singapore Premier League stadium in 2023 with natural field grass that looks pristine when maintained. Home to the Sailors and temporarily Baletier Khalsa, the food provided during LCS games are also decent. The only drawback would be the interference of the running track as well as the seats being too close for comfort\"",
          "steps": [
            {
              "description": "What's the answer to the riddle? Answer ALL CAPS. The answer is 3 words. Ask @jloh02 for help if needed",
              "type": "Text",
              "answer": "BISHAN ACTIVESG STADIUM"
            },
            {
              "description": "The whole group must collectively run 400m around the track. Every member must do a different movement type (eg backward run, lunges, skip, etc). Take a video and use the phone as a baton. The camera must face the person and show what the person is doing.",
              "type": "Video"
            }
          ]
        }
      ]
    },
    "Serangoon": {
      "order": 2,
      "challenges": [
        {
          "description": "Find a red, blue and green logo on a facade of a building that represents the building. You'll be asked to recreate a pose in-front of it",
          "steps": [
            {
              "description": "Send a photo in front of the logo recreating this pose",
              "media": "love.png",
              "type": "Photo"
            }
          ]
        },
        {
          "description": "I have many stories but can't utter a word,\nWith shelves full of worlds, yet no wings like a bird.\nWhispers of knowledge, in silence they scream,\nIn my quiet halls, where knowledge is a dream.\nWhat am I?",
          "steps": [
            {
              "description": "What am I? Answer in ALL CAPS. Text @jloh02 if you think you got the answer right",
              "type": "Text",
              "answer": "LIBRARY"
            },
            {
              "description": "In the library, find 7 different books containing 7 different pictures of creatures/things you can find in the sea. Send me 7 pictures.",
              "type": "Photo",
              "num_photo": 7
            }
          ]
        }
      ]
    },
    "Woodleigh": {
      "order": 3,
      "challenges": [
        {
          "description": "Unscramble each word to give a sea creature, then arrange the words in order such that the 1st letter of each word spells the name of a shop in woodleigh mall\n\naunt\nhlofsbib\nsyreot\naynstirg\ntposocu",
          "steps": [
            {
              "description": "What is the name of the shop? Answer in ALL CAPS",
              "type": "Text",
              "answer": "BOOST"
            },
            {
              "description": "Find the shop and take a group photo with it",
              "type": "Photo"
            }
          ]
        },
        {
          "description": "Head to Woodleigh mall B2 and take a picture in front of a store",
          "steps": [
            {
              "description": "You have 2 mins to find and take a pic as a group! Hurry before the picture changes! This challenge continues until you get 1 correct answer within the time frame.",
              "rotating_media": "woodleigh",
              "type": "Photo"
            }
          ]
        }
      ]
    },
    "Farrer Park": {
      "order": 4,
      "challenges": [
        {
          "description": "Find a specific store within City Square Mall. /submit to find out more!",
          "steps": [
            {
              "description": "Find the unit number and store within City Square Mall:\nFor the floor number: Find a fish with its eyes closed\nFor the unit number: Find a fish that is smiling\nAnswer Format: xx-xx, STORE_NAME_IN_ALL_CAPS. Don't forget the space after the comma! Ask @jloh02 if you think you got the answer",
              "media": "waldo.jpg",
              "type": "Text",
              "answer": "02-03, DECATHLON"
            },
            {
              "description": "Go to Decathlon. Dress one member in an full outfit of a selected sport. Outfit must include top, bottoms, headgear, shoes and the equipment needed for that sport. Send a photo of your coolest sportiest person!",
              "type": "Photo"
            }
          ]
        }
      ]
    }
  },
  "bonus": {
    "challenges": [
      {
        "description": "Sing any part of camp theme song for 30s",
        "steps": [
          {
            "description": "Send a video of your group singing the camp theme song",
            "type": "Video"
          }
        ]
      },
      {
        "description": "Take a photo with another group",
        "steps": [
          {
            "description": "Send the photo",
            "type": "Photo"
          }
        ]
      },
      {
        "description": "Take a video of your group doing a viral TikTok dance",
        "steps": [
          {
            "description": "Send your TikTok video and go viral!",
            "type": "Video"
          }
        ]
      },
      {
        "description": "Take a jumping picture with your entire group mid-air",
        "steps": [
          {
            "description": "Send your cool photo!",
            "type": "Photo"
          }
        ]
      },
      {
        "description": "Take a group photo with a Christmas tree",
        "steps": [
          {
            "description": "Send your Christmas-sy photo!",
            "type": "Photo"
          }
        ]
      },
      {
        "description": "Take a picture with 3 different kinds of animals",
        "steps": [
          {
            "description": "Send your animal loving photo!",
            "type": "Photo"
          }
        ]
      },
      {
        "description": "Take a panorama shot, everyone except the GL (photographer) must appear twice in the photo.",
        "steps": [
          {
            "description": "Send your duplicating photo and make camp comm confused!",
            "type": "Photo"
          }
        ]
      }
    ]
  }
}
